---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSetIterator.#ctor
source: html/ea68ad36-f9dc-985b-e2ac-32b6da361ff1.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public WireSizeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.